Autodesk.Revit.DB.Mechanical.MechanicalSystemType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.MEPSystemClassification,System.String)
Creates a new instance of a mechanical system type and adds it to the document.
ADoc:
The document where the element will be created and added.
systemClassification:
The classification for the mechanical system type to be created
name:
The name of the mechanical system type to be created.
Returns:
The newly created mechanical system type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The system classification is not valid for the domain of this system type.
Since:
2012